*** Linux版本号
Linux的版本号分为两部分：内核（Kernel）和发行套件（Distribute）版本，
内核版本号一般为x.y.zz-wwww,
+ x.y为Linux的主版本号
+ zz为次版本号
+ www表示发行号。

#+header: :exports both
#+BEGIN_SRC sh
uname -a    # 列出Linux系统版本号
#+END_SRC

#+RESULTS:
: Linux ben 3.13.0-48-generic #80-Ubuntu SMP Thu Mar 12 11:16:18 UTC 2015 i686 i686 i686 GNU/Linux



#+BEGIN_EXAMPLE

#+END_EXAMPLE

**** type

对于linux读取 ntfs分区靠的是 *ntfs-3g*, 所以首先检查下ntfs-3g有没有安
装:
#+BEGIN_SRC sh :exports both
dpkg -l | grep ntfs-3g
#+END_SRC

#+RESULTS:
: ii  ntfs-3g                                               1:2013.1.13ar.1-2ubuntu2                            i386         read/write ntfs driver for fuse

#+BEGIN_EXAMPLE
sudo apt-get install ntfs-3g
#+END_EXAMPLE

**** Linux 文件 /etc/udev/rules.d/

#+BEGIN_SRC sh :results output
cat /etc/udev/rules.d/README
#+END_SRC

#+RESULTS:
#+begin_example
The files in this directory are read by udev(7) and used when events
are performed by the kernel.  The udev daemon watches this directory
with inotify so that changes to these files are automatically picked
up, for this reason they must be files and not symlinks to another
location as in the case in Debian.

Packages do not generally install rules here, this directory is for
local rules.  If you want to override behaviour of package-supplied
rules, which can be found in /lib/udev/rules.d, you can do one of
two things:

 1) Write your own rules in this directory that assign the name,
    symlinks, permissions, etc. that you want.  Pick a number higher
    than the rules you want to override, and yours will be used.

 2) Copy the file from /lib/udev/rules.d and edit it here; you
    should generally only do this if you want to prevent a program
    from being run.


If the ordering of files in this directory are not important to you,
it's recommended that you simply name your files "descriptive-name.rules"
such that they are processed AFTER all numbered rules in both this
directory and /lib/udev/rules.d and thus override anything set there.
#+end_example

*** echo                                                             :echo:
1. 引号
   #+begin_src sh :exports both
   echo hello world
   #+end_src

   #+results:
   : hello world

   #+begin_src sh :exports both
   echo "hello world"
   #+end_src

   #+results:
   : hello world

   #+begin_src sh :exports both
   echo 'hello world'
   #+end_src

   #+results:
   : hello world

   #+begin_src sh :exports both
   echo "hello bash's world"
   #+end_src

   #+results:
   : hello bash's world

2. 命令续行
   #+begin_src sh :exports both
   echo hello \
   world
   #+end_src

   #+results:
   : hello world

3. 换行

   #+begin_src sh :exports both
   echo "hello
   world"
   #+end_src

   #+results:
   | hello |
   | world |

   #+begin_src sh :exports both
   echo "hello \
   world"
   #+end_src

   #+results:
   : hello world

   #+begin_src sh :exports both
   echo  "hello"
   echo "world"
   #+end_src

   #+results:
   | hello |
   | world |

4. 行尾默认增加执行与 -n 选项

   #+begin_src sh :exports both
   echo -n "hello"
   echo "world"
   #+end_src

   #+results:
   : helloworld

   #+begin_src sh :exports code
     echo "hello\nworld"
     # hello\nworld
   #+end_src


   注：babel和terminal执行的结果不一样,因为org-babel默认的是sh,而ubuntu
   terminal使用的bash, 两者在使用上存在一定差异

5. -e 选项
   #+begin_src sh :exports both
   echo -e "hello\nworld"
   #+end_src

   #+results:
   | hello |
   | world |

*** du: 查看磁盘文件大小                                                                 :du:

du命令适合用来 /查看文件大小/ 等,要比ls命令强大的多

linux *du* 命令也是查看使用空间的，但是与df命令不同的是linux du命令是
对文件和目录磁盘使用的空间的查看，还是和df命令有一些区别的.

1. 命令格式

   *du [选项][文件]*

2. 命令功能：

   *显示每个文件和目录的磁盘使用空间*

3. 命令参数：

   1) -a, -all

      显示目录中个别文件的大小

   2) -b, -bytes

      显示目录或文件大小时，以byte为单位

   3) -c, --total

      除了显示个别目录或文件的大小外，同时也显示所有目录或文件的总和

   4) -k, --kilobytes

      以kb(1024bytes)为单位输出。

   5) -m, --megabytes

      以mb为单位输出

   6) /-s/, --summarize

      仅显示总计，只列出最后加总的值。

   7) /-h/, --human-readable

      以k，m，g为单位，提高信息的可读性。

   8) -x, --one-file-xystem

      以一开始处理时的文件系统为准，若遇上其它不同的文件系统目录则略过。

   9) -l <符号链接>, --dereference <符号链接>

      显示选项中所指定符号链接的源文件大小。

   10) -S, --separate-dirs

       显示个别目录的大小时，并不含其子目录的大小。

   11) -x<文件>, --exclude-from=<文件>

       在<文件>指定目录或文件。

   12) --exclude=<目录, 文件>

       略过指定的目录或文件。

   13) -d, --dereference-args

       显示指定符号链接的源文件大小。

   14) -h, --si

       与-h参数相同，但是k，m，g是以1000为换算单位。

   15) -l, --count-links

       重复计算硬件链接的文件。

4. 使用实例：

   1) 实例1：显示目录或者文件所占空间 命令：du

      说明：只显示当前目录下面的子目录的目录大小和当前目录的总的大小，

      #+BEGIN_SRC sh :results output
      du ~/Picture
      #+END_SRC

      #+RESULTS:
      #+begin_example
      312	/home/ben/Picture/Wallpapers
      1428	/home/ben/Picture/Weibo/折纸之收纳盒_6_files
      3812	/home/ben/Picture/Weibo
      4932	/home/ben/Picture/WALLE/others
      9828	/home/ben/Picture/WALLE/walle
      16460	/home/ben/Picture/WALLE/W&E
      31224	/home/ben/Picture/WALLE
      6848	/home/ben/Picture/Guita/入门
      8012	/home/ben/Picture/Guita
      5148	/home/ben/Picture/tagerill
      71812	/home/ben/Picture
      #+end_example


      最下面的为当前目录的总大小

   2) 实例2：显示指定文件所占空间

      #+BEGIN_SRC sh
      du ~/.xinitrc
      #+END_SRC

   3) 实例3：查看指定目录的所占空间

      #+BEGIN_SRC sh
      du -sc ~/.ros
      #+END_SRC

      #+RESULTS:
      | 6356 | /home/ben/.ros |
      | 6356 | 总用量         |


   4) 实例4：显示多个文件所占空间  命令：

      #+BEGIN_SRC sh
      du log30.tar.gz log31.tar.gz
      #+END_SRC

   5) 实例5：只显示总和的大小

      #+BEGIN_SRC sh
      du -s
      #+END_SRC

   6) 实例6：方便阅读的格式显示 *注：默认单位为字节*

      #+BEGIN_SRC sh
      du -h test*
      #+END_SRC

   7) 实例7：文件和目录都显示  命令： 输出：

   8) 实例8：显示几个文件或目录各自占用磁盘空间的大小，还统计它们的总
      和
      #+BEGIN_SRC sh
      du -c log30.tar.gz log31.tar.gz
      #+END_SRC

      说明：加上-c选项后，du不仅显示两个目录各自占用磁盘空间的大小，还
      在最后一行统计它们的总和。

   9) 实例9：按照空间大小排序 命令：

      #+BEGIN_SRC sh
      du | sort -nr | more
      #+END_SRC

   10) 实例10：输出当前目录下各个子目录所使用的空间  命令：

       #+BEGIN_SRC sh
       du -h --max-depth=1
       #+END_SRC

*** ps                                                                 :ps:
1. 功能： *process status*, 列出当前进程的快照，即执行ps命令的那个时刻
   的进程。
   + 静态，如果想要动态显示进程，则需使用 *top* 命令

2. linux进程状态
   + 运行 r(runnable)
   + 中断 s(sleeping)
   + 不可中断 d(uninterruptible sleep)
   + 僵死 z(defunct)
   + 停止t(stopped)

3. 格式: ps [参数]

4. 参数
   + a 显示所有进程
   + -a 显示同一终端下的所有进程
   + -a 显示所有进程
   + c 显示进程真实名称
   + -n 反向选择
   + -e 同-a
   + e 显示环境变量
   + f 显示程序之间的关系
   + -h 显示树状结构
   + r 显示当前终端进程
   + t 显示当前终端的所有程序
   + u 指定用户的所有进程
   + -au 详细

   #+header: :exports both
   #+header: :results output
   #+begin_src sh
   ps -ef | grep emacs
   #+end_src

   #+results:
   : ben       3662  2842  1 13:20 pts/0    00:01:33 emacs
   : ben       3889  3662  0 13:20 pts/4    00:00:00 bash /home/ben/.ckws/install/share/emacs/site-lisp/poll-rostopic 8
   : ben       3893  3662  0 13:20 pts/15   00:00:00 bash /home/ben/.ckws/install/share/emacs/site-lisp/poll-rosnode 8
   : ben       4614  3662  0 13:21 ?        00:00:08 /home/ben/.emacs.d/elpa/pdf-tools-20150401.1031/epdfinfo
   : ben      11322 11320  0 15:20 ?        00:00:00 grep emacs
 :ps:
**** example

#+BEGIN_SRC sh :results output
free -h
#+END_SRC

#+RESULTS:
:              total       used       free     shared    buffers     cached
: Mem:          3.7G       2.0G       1.6G       4.7M       377M       689M
: -/+ buffers/cache:       1.0G       2.7G
: Swap:         3.8G       1.1G       2.7G

*** tr                                                                 :tr:
1. 功能： 转换或删除字符, 从标准输入设备读取数据，经过字符串转译后，输
   出到标准输出设备。

   可以将 tr 看作为 sed 的（极其）简化的变体：它可以用一个字符来替换另
   一个字符，或者可以完全除去一些字符。您也可以用它来除去重复字符。这
   就是所有 tr 所能够做的。

2. 格式：tr [option] set1 [set2]

3. 选项
   + -c或--complerment   取代所有不属于第一字符集的字符。
   + -d或--delete   删除所有属于第一字符集的字符。
   + -s或--squeeze-repeats   把连续重复的字符以单独一个字符表示。
   + -t或--truncate-set1   这个比较难理解，man上面的解释是：first
     truncate set1 to lengthof set2,经过我的实践发现，将set1的字符依次
     替换成set2中的字符，如果set1中的字符数目超过set2，那么set1多出的
     字符忽略。如果没有-t，那么多出的字符都替换成set2的最后一个字符。

4. 字符范围：指定字符串1或字符串2的内容时，只能使用单字符或字符串范围
   或列表。
   + [a-z] a-z内的字符组成的字符串。
   + [a-z] a-z内的字符组成的字符串。
   + [0-9] 数字串。
   + \textbackslash{}octal 一个三位的八进制数，对应有效的ascii字符。
   + [o*n] 表示字符o重复出现指定次数n。因此[o*2]匹配oo的字符串。
5. 例程
   1) 压缩文件中的重复字符
      #+header: :exports both
      #+begin_src sh
      echo abbccd | tr -s [a-z]
      #+end_src

      #+results:
      : abcd

      注：
      + [a-z]指定字符集合，而非字符串

   2) 去掉多余空行
      #+header: :exports both
      #+header: :results output
      #+begin_src sh
        echo -e "abc\n\nxyz"
        echo
        echo -e "abc\n\n\nxyz" | tr -s ["\n"]  # 或 "[\12]"
      #+end_src

      #+results:
      : abc
      :
      : xyz
      :
      : abc
      : xyz

   3) 删除文件中的^m，并代之以换行
      在linux下，不可避免的会用vim打开一些windows下编辑过的文本文件。
      我们会发现文件的每行结尾都会有一个^m符号，这是因为 dos下的编辑器
      和linux编辑器对文件行末的回车符处理不一致
      + window: \textbackslash{}r\textbackslash{}n
      + linux: \textbackslash{}n

      #+begin_example
      tr -s "[\r]" "[\n]" < input
      #+end_example

   4) 替换冒号
      #+begin_example
      tr -s "[:]" "[,]" < input
      #+end_example

   5) 显示path
      #+header: :exports both
      #+header: :results output
      #+begin_src sh
      echo $path | tr ":" "\n"
      #+end_src

      #+results:
      #+begin_example
      /home/ben/program/phantomjs/bin
      /usr/local/qt-5.4.1/bin
      /usr/home/ben/bin
      /home/ben/.ckws/devel/bin
      /opt/ros/indigo/bin
      /usr/local/texlive/2014/bin/i386-linux
      /home/ben/bin
      /usr/local/sbin
      /usr/local/bin
      /usr/sbin
      /usr/bin
      /sbin
      /bin
      /usr/games
      /usr/local/games
      /usr/local/libexec/emacs/24.4/i686-pc-linux-gnu
      #+end_example

   6) 替换字符集外的所有字符为指定字符
      #+header: :exports both
      #+header: :results output
      #+begin_src sh
      echo -n "abcdefg" | tr -c [ag] "o"
      #+end_src

      #+results:
      : aooooog

   7) 删除指定字符集的所有字符
      #+header: :exports both
      #+header: :results output
      #+begin_src sh
        echo  "foobar" | tr -d "for"
        echo  "foorbar" | tr -d for
        echo  "foorbar" | tr -d [for]
      #+end_src

      #+results:
      : ba
      : ba
      : ba

   8) 转换大小写
      #+header: :exports both
      #+header: :results output
      #+begin_src sh
        echo "abcxyz" | tr a-z a-z
        echo "abcxyz" | tr [a-z] [a-z]
      #+end_src

      #+results:
      : abcxyz
      : abcxyz

   9) 依次替换
      #+header: :exports both
      #+header: :results output
      #+begin_src sh
      echo "foobar" | tr -t fb bf
      #+end_src

      #+results:
      : boofar

***** s 命令替换
1. 准备
   #+BEGIN_SRC sh :session sed_session :exports code
     cd /tmp
     > pets.txt
     echo -n "This is my cat," >> pets.txt
     echo  "my cat's name is betty" >> pets.txt
     echo -n "This is my dog," >> pets.txt
     echo "my dog's name is frank" >> pets.txt
     echo -n "This is my fish," >> pets.txt
     echo  "my fish's name is george" >> pets.txt
     echo -n "This is my goat," >> pets.txt
     echo  "my goat's name is adam" >> pets.txt
   #+END_SRC

   #+RESULTS:

   注： org-babel 使用:session参数时要注意命令中的回车可能使执行一直处于
   等待状态。

   #+RESULTS:

   #+BEGIN_SRC sh :exports both :session sed_session :results output
    cat pets.txt
   #+END_SRC

   #+RESULTS:
   : this is my cat,my cat's name is betty
   : This is my dog,my dog's name is frank
   : This is my fish,my fish's name is george
   : This is my goat,my goat's name is adam

2. -s 替换

   #+BEGIN_SRC sh :exports both :session sed_session :results output
   sed "s/my/your/g" pets.txt
   #+END_SRC

   #+RESULTS:
   : this is your cat,your cat's name is betty
   : This is your dog,your dog's name is frank
   : This is your fish,your fish's name is george
   : This is your goat,your goat's name is adam

3. 写入
   + 重定向
   + -i

   #+BEGIN_SRC sh :exports both :session sed_session :results output
   sed -i "s/my/your/g" pets.txt
   cat pets.txt
   #+END_SRC

   #+RESULTS:
   :
   : This is your cat,your cat's name is betty
   : This is your dog,your dog's name is frank
   : This is your fish,your fish's name is george
   : This is your goat,your goat's name is adam

4. 行前
   + *^* 表示一行的开头
   + *$* 表示一行的结尾
   + *\<* 表示词首
   + *\>* 表示词尾
   + 以上是正则表达式的最基本的内容

   #+BEGIN_SRC sh :exports both :session sed_session :results output
   sed "s/^/:/g" pets.txt
   #+END_SRC

   #+RESULTS:
   : :this is your cat,your cat's name is betty
   : :This is your dog,your dog's name is frank
   : :This is your fish,your fish's name is george
   : :This is your goat,your goat's name is adam

   注： 行首#在babel输出可能有问题

   #+BEGIN_SRC sh :exports both :session sed_session :results output
   sed 's/$/:/g' pets.txt
   #+END_SRC

   #+RESULTS:
   : this is your cat,your cat's name is betty:
   : this is your dog,your dog's name is frank:
   : this is your fish,your fish's name is george:
   : this is your goat,your goat's name is adam:

5. 指定行替换
   #+BEGIN_SRC sh :exports both :session sed_session :results output
   sed "3s/your/my/g" pets.txt  # 替换第三行
   #+END_SRC

   #+RESULTS:
   : this is your cat,your cat's name is betty
   : This is your dog,your dog's name is frank
   : This is my fish,my fish's name is george
   : This is your goat,your goat's name is adam

   #+BEGIN_SRC sh :exports both :session sed_session :results output
   sed "3,6s/your/my/g" pets.txt  # 替换3～6行
   #+END_SRC

   #+RESULTS:
   : this is your cat,your cat's name is betty
   : This is your dog,your dog's name is frank
   : This is my fish,my fish's name is george
   : This is my goat,my goat's name is adam

6. 替换行中的指定匹配项
   #+BEGIN_SRC sh :exports both :session sed_session :results output
   sed 's/s/S/1' pets.txt    # 替换匹配的第一项
   #+END_SRC

   #+RESULTS:
   : this is your cat,your cat's name is betty
   : ThiS is your dog,your dog's name is frank
   : ThiS is your fish,your fish's name is george
   : ThiS is your goat,your goat's name is adam

   #+BEGIN_SRC sh :exports both :session sed_session :results output
   sed "s/s/S/2" pets.txt   # 替换第二项
   #+END_SRC

   #+RESULTS:
   : this is your cat,your cat's name is betty
   : This iS your dog,your dog's name is frank
   : This iS your fish,your fish's name is george
   : This iS your goat,your goat's name is adam

   #+BEGIN_SRC sh :exports both :session sed_session :results output
   sed 's/s/S/1g' pets.txt    # 替换某一项之后的
   #+END_SRC

   #+RESULTS:
   : this is your cat,your cat's name is betty
   : ThiS iS your dog,your dog'S name iS frank
   : ThiS iS your fiSh,your fiSh'S name iS george
   : ThiS iS your goat,your goat'S name iS adam

***** 多个匹配
+ 使用多个分号将匹配分隔
+ 相当于 *-e* 选项


#+BEGIN_SRC sh :exports both :session sed_session :results output
sed "1s/your/my/g; 2s/name/NAME/g" pets.txt
#+END_SRC

#+RESULTS:
: this is my cat,my cat's name is betty
: This is your dog,your dog's NAME is frank
: This is your fish,your fish's name is george
: This is your goat,your goat's name is adam

#+BEGIN_SRC sh :exports both :session sed_session :results output
sed -e "1s/your/my/g" -e "2s/name/NAME/g" pets.txt
#+END_SRC

#+RESULTS:
: this is my cat,my cat's name is betty
: This is your dog,your dog's NAME is frank
: This is your fish,your fish's name is george
: This is your goat,your goat's name is adam

***** 圆括号匹配，即后向引用
+ [^,] 表示除了,以外的任意字符(正则表达式的基本知识)

#+BEGIN_SRC sh :exports both :session sed_session :results output
sed 's/This is your \([^,]*\),.*is *\(.*\)/\1:\2/g' pets.txt
#+END_SRC

#+RESULTS:
: cat:betty
: dog:frank
: fish:george
: goat:adam

*** TOBECONTINED sed入门                                              :sed:
- State "TOBECONTINED" from "TODO"       [2015-12-06 日 11:09] \\
  了解了Sed的基本用法和正则，深入学习需要有使用的需求
CLOCK: [2015-12-06 日 10:38]--[2015-12-06 日 11:08] =>  0:30
**** install & check

1. Linux 发行版本默认安装
2. apt-get
3. [[ftp://ftp.gnu.org/gnu/sed/][source code]]

#+BEGIN_SRC sh :results output :exports both
sed --version
#+END_SRC

#+RESULTS:
#+begin_example
sed (GNU sed) 4.2.2
Copyright (C) 2012 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.

Written by Jay Fenlason, Tom Lord, Ken Pizzini,
and Paolo Bonzini.
GNU版sed主页： <http://www.gnu.org/software/sed/>。
使用GNU软件所需帮助文档： <http://www.gnu.org/gethelp/>。
将错误报告通过电子邮件发送到：<bug-sed@gnu.org>.
请务必将单词“sed”放在标题的某处。
#+end_example

*** wkhtmltopdf                                      :wkhtmltopdf:pdf:html:

CLOCK: [2015-11-25 三 09:26]--[2015-11-25 三 09:37] =>  0:11

**** 手记

$ pdfinfo --help

#+BEGIN_EXAMPLE
  pdfinfo version 0.24.5
  Copyright 2005-2013 The Poppler Developers - http://poppler.freedesktop.org
  Copyright 1996-2011 Glyph & Cog, LLC
  Usage: pdfinfo [options] <PDF-file>
    -f <int>          : first page to convert
    -l <int>          : last page to convert
    -box              : print the page bounding boxes
    -meta             : print the document metadata (XML)
    -rawdates         : print the undecoded date strings directly from the PDF file
    -enc <string>     : output text encoding name
    -listenc          : list available encodings
    -opw <string>     : owner password (for encrypted files)
    -upw <string>     : user password (for encrypted files)
    -v                : print copyright and version info
    -h                : print usage information
    -help             : print usage information
    --help            : print usage information
    -?                : print usage information
#+END_EXAMPLE


#+BEGIN_SRC sh :results output :exports both
pdfinfo ~/Wally/Journal/journal.pdf
#+END_SRC

#+RESULTS:
#+begin_example
Creator:        Emacs 24.4.1 (Org mode 8.2.10)
Producer:       xdvipdfmx (20140317)
CreationDate:   Wed Nov 25 09:40:33 2015
Tagged:         no
Form:           none
Pages:          3
Encrypted:      no
Page size:      612 x 792 pts (letter)
Page rot:       0
File size:      138622 bytes
Optimized:      no
PDF version:    1.5
#+end_example

